Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.CurtainPanelsParamDefinedTypeDefinedCirculary Property
 Parameter-defined type of curtain panels defined in a circular way and default panel type will be used instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurtainPanelsParamDefinedTypeDefinedCirculary { get; }
Public Shared ReadOnly Property CurtainPanelsParamDefinedTypeDefinedCirculary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurtainPanelsParamDefinedTypeDefinedCirculary {
	FailureDefinitionId^ get ();
}
static member CurtainPanelsParamDefinedTypeDefinedCirculary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace